hysonglet/platformio_synwit/misc/svd/SWM181.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IRQMUX</name>
      <description>Registers group</description>
      <groupName>IRQMUX</groupName>
      <baseAddress>0x45000000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000314</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IRQ0_SRC</name>
          <description>IRQ0_SRC register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ1_SRC</name>
          <description>IRQ1_SRC register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ2_SRC</name>
          <description>IRQ2_SRC register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ3_SRC</name>
          <description>IRQ3_SRC register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ4_SRC</name>
          <description>IRQ4_SRC register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ5_SRC</name>
          <description>IRQ5_SRC register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ6_SRC</name>
          <description>IRQ6_SRC register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ7_SRC</name>
          <description>IRQ7_SRC register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ8_SRC</name>
          <description>IRQ8_SRC register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ9_SRC</name>
          <description>IRQ9_SRC register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ10_SRC</name>
          <description>IRQ10_SRC register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ11_SRC</name>
          <description>IRQ11_SRC register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ12_SRC</name>
          <description>IRQ12_SRC register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ13_SRC</name>
          <description>IRQ13_SRC register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ14_SRC</name>
          <description>IRQ14_SRC register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ15_SRC</name>
          <description>IRQ15_SRC register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IRQ16_IF</name>
          <description>IRQ16_IF register</description>
          <addressOffset>0x000140</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ17_IF</name>
          <description>IRQ17_IF register</description>
          <addressOffset>0x000144</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ18_IF</name>
          <description>IRQ18_IF register</description>
          <addressOffset>0x000148</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ19_IF</name>
          <description>IRQ19_IF register</description>
          <addressOffset>0x00014C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ20_IF</name>
          <description>IRQ20_IF register</description>
          <addressOffset>0x000150</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ21_IF</name>
          <description>IRQ21_IF register</description>
          <addressOffset>0x000154</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ22_IF</name>
          <description>IRQ22_IF register</description>
          <addressOffset>0x000158</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ23_IF</name>
          <description>IRQ23_IF register</description>
          <addressOffset>0x00015C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ24_IF</name>
          <description>IRQ24_IF register</description>
          <addressOffset>0x000160</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ25_IF</name>
          <description>IRQ25_IF register</description>
          <addressOffset>0x000164</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ26_IF</name>
          <description>IRQ26_IF register</description>
          <addressOffset>0x000168</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ27_IF</name>
          <description>IRQ27_IF register</description>
          <addressOffset>0x00016C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ28_IF</name>
          <description>IRQ28_IF register</description>
          <addressOffset>0x000170</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ29_IF</name>
          <description>IRQ29_IF register</description>
          <addressOffset>0x000174</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ30_IF</name>
          <description>IRQ30_IF register</description>
          <addressOffset>0x000178</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ31_IF</name>
          <description>IRQ31_IF register</description>
          <addressOffset>0x00017C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ16_SRC</name>
          <description>IRQ16_SRC register</description>
          <addressOffset>0x000240</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ17_SRC</name>
          <description>IRQ17_SRC register</description>
          <addressOffset>0x000244</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ18_SRC</name>
          <description>IRQ18_SRC register</description>
          <addressOffset>0x000248</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ19_SRC</name>
          <description>IRQ19_SRC register</description>
          <addressOffset>0x00024C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ20_SRC</name>
          <description>IRQ20_SRC register</description>
          <addressOffset>0x000250</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ21_SRC</name>
          <description>IRQ21_SRC register</description>
          <addressOffset>0x000254</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ22_SRC</name>
          <description>IRQ22_SRC register</description>
          <addressOffset>0x000258</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ23_SRC</name>
          <description>IRQ23_SRC register</description>
          <addressOffset>0x00025C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ24_SRC</name>
          <description>IRQ24_SRC register</description>
          <addressOffset>0x000260</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ25_SRC</name>
          <description>IRQ25_SRC register</description>
          <addressOffset>0x000264</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>INT0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>INT1 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
