hysonglet/platformio_synwit/misc/svd/SWM181.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Registers group</description>
      <groupName>DMA</groupName>
      <baseAddress>0x41000000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000058</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EN</name>
          <description>EN register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAN</name>
              <description>CAN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDADC</name>
              <description>SDADC field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFLASH</name>
              <description>RFLASH field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WFLASH</name>
              <description>WFLASH field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>IM register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAN</name>
              <description>CAN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDADC</name>
              <description>SDADC field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFLASH</name>
              <description>RFLASH field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WFLASH</name>
              <description>WFLASH field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAN</name>
              <description>CAN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDADC</name>
              <description>SDADC field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFLASH</name>
              <description>RFLASH field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WFLASH</name>
              <description>WFLASH field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CH0</name>
          <description>register cluster</description>
          <addressOffset>0x000010</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REN</name>
                <description>REN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH1</name>
          <description>register cluster</description>
          <addressOffset>0x00001C</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REN</name>
                <description>REN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH2</name>
          <description>register cluster</description>
          <addressOffset>0x000028</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REN</name>
                <description>REN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH3</name>
          <description>register cluster</description>
          <addressOffset>0x000034</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REN</name>
                <description>REN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH4</name>
          <description>register cluster</description>
          <addressOffset>0x000040</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REN</name>
                <description>REN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH5</name>
          <description>register cluster</description>
          <addressOffset>0x00004C</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REN</name>
                <description>REN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
